#+title: First Article SotA
#+author: Maxime Gaide

#+TBLNAME: papers
#+STARTUP: shrink
|----+------------------------------------------------------------------------------------------------------------------------------+----------------+------|
|    | title                                                                                                                        | first author   | year |
|    | <80>                                                                                                                         |                |      |
|----+------------------------------------------------------------------------------------------------------------------------------+----------------+------|
|  1 | N-dimensional generalized combinatorial maps and cellular quasi-manifolds                                                    | Lienhardt      | 1994 |
|  2 | A mechanism for persistently naming topological entities in history-based parametric solid models                            | Kripac         | 1995 |
|  3 | Generic naming in generative, constraint-based design.                                                                       | Capoyleas      | 1996 |
|  4 | Semantic feature modelling                                                                                                   | Bidarra        | 2005 |
|  5 | Identification of topological entities and naming mapping for parametric cad model exchange                                  | Mun            | 2005 |
|  6 | A persistent naming of shell                                                                                                 | Marcheix       | 2006 |
|  7 | Generic computation of bulletin boards into geometric kernels                                                                | Baba-Ali       | 2007 |
|  8 | graph transformation library for topology-based geometric modeling                                                           | Belhaouari     | 2014 |
|  9 | general physical-topological framework using rule-based language for physical simulation                                     | Ben Salah      | 2017 |
| 10 | Subdividing triangular and quadrilateral meshes in parallel to approximate curved geometries                                 | Gargallo-Peiro | 2017 |
| 11 | Mechanisms of persistent identification of topological entities in CAD systems: A review                                     | Farjana        | 2018 |
| 12 | AlSub: fully parallel and modular subdivision                                                                                | Mlakar         | 2018 |
| 13 | Persistent naming based on graph transformation rules to reevaluate parametric specification                                 | Cardot         | 2019 |
| 14 | Assembly Solving for Neutral Re-Imported Product Models                                                                      | Jauhar         | 2020 |
| 15 | Transparent Parallelization of Enrichment Operations in Geometric Modeling                                                   | Bourquat       | 2020 |
| 16 | Cooperative versus non-cooperative parallel variable neighborhood search strategies                                          | kalatzanonakis | 2020 |
| 17 | Point-oriented persistent identification of entities for exchanging parametric CAD data                                      | Safdar         | 2020 |
| 18 | Feature-based translation of CAD models with macro-parametric approach                                                       | Safdar         | 2020 |
| 19 | Reconstructing editable prismatic CAD from rounded voxel models                                                              | Lambourne      | 2022 |
| 20 | ComplexGen: CAD reconstruction by B-rep chain complex generation                                                             | H. Guo         | 2022 |
| 21 | 3D convolutional neural network for machining feature recognition with gradient-based visual explanations from 3D CAD models | J.Lee          | 2022 |
| 22 | Inferring topological operations on generalized maps: Application to subdivision schemes                                     | Pascual        | 2022 |
| 23 | Towards computing complete parameter ranges in parametric modeling                                                           | Tang           | 2022 |
| 24 | Differentiable 3d cad programs for bidirectional editing                                                                     | Cascaval       | 2022 |
| 25 | Parametric CAD Modeling: New Principles for Robust Sketch Constraints                                                        | Nerenst        | 2023 |
| 26 | Query-replace operations for topologically controlled 3D mesh editing                                                        | Damiand        | 2022 |
| 27 | Enhancements for Improved Topological Entity Identification Performance in Multi-user CAD                                    | Hepworth       | 2015 |
|    | Push-Pull Direct Modeling of Solid CAD Models                                                                                | Qiang Zou      | 2019 |
|----+------------------------------------------------------------------------------------------------------------------------------+----------------+------|
#+TBLFM: $1=(@#-2)
